posts/2015-01-13-memorial-day-prayer.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Memorial Day Prayer

God of creation,

You gave us our first breath,\\
Raised us up as we took our first feeble steps,\\
Walked with us through the valleys of darkness,\\
Comforted us during the times of loss,\\
And you will welcome us into your arms when we pass from this life.\\
\\
Today we remember those who have gone before,\\
Those who have given their lives for their country's sake,\\
Those who sacrificed their own comfort so that others may prosper,\\
And those who have cried out with our Lord from Gethsemane:\\
"Not my will, but thine be done."\\
\\
\\
And so,\\
Gracious God,\\
We ask for strength,\\
So that we may live lives\\
Worthy of those who have gone before.\\
\\
And may you accept the gifts we offer\\
As a material symbol of a spiritual sacrifice,\\
the sacrifice of our very lives.\\
\\
For they are already yours,\\
Redeemed by the shed blood and broken body\\
Of our Lord Jesus Christ,\\
In whose name we pray.\\

/Amen/


#+begin_tagline
Tagged: prayer
#+end_tagline
