docs/posts/2015-01-13-memorial-day-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Memorial Day Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Memorial Day Prayer</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
God of creation,
</p>

<p>
You gave us our first breath,<br>
Raised us up as we took our first feeble steps,<br>
Walked with us through the valleys of darkness,<br>
Comforted us during the times of loss,<br>
And you will welcome us into your arms when we pass from this life.<br>
<br>
Today we remember those who have gone before,<br>
Those who have given their lives for their country&rsquo;s sake,<br>
Those who sacrificed their own comfort so that others may prosper,<br>
And those who have cried out with our Lord from Gethsemane:<br>
&ldquo;Not my will, but thine be done.&rdquo;<br>
<br>
<br>
And so,<br>
Gracious God,<br>
We ask for strength,<br>
So that we may live lives<br>
Worthy of those who have gone before.<br>
<br>
And may you accept the gifts we offer<br>
As a material symbol of a spiritual sacrifice,<br>
the sacrifice of our very lives.<br>
<br>
For they are already yours,<br>
Redeemed by the shed blood and broken body<br>
Of our Lord Jesus Christ,<br>
In whose name we pray.<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org07f2507">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
